# IsSurfaceToleranceSet Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
STLExportOptions..::..IsSurfaceToleranceSet Method
STLExportOptions Class See Also
---
Checks whether the SurfaceTolerance tessellation parameter is explicitly set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public bool IsSurfaceToleranceSet()
```

Visual Basic
---
```text
Public Function IsSurfaceToleranceSet As Boolean
```

Visual C++
---
```text
public:
bool IsSurfaceToleranceSet()
```

# ### Return Value
True if SurfaceTolerance tessellation parameter is explicitly set, false otherwise.
# See Also
STLExportOptions Class
Autodesk.Revit.DB Namespace